{
	"version":"0.6",
    "pageContent": 
	{
        "_comments": "JSON object that contains data for page labels, buttons, etc.",
        "navItems": 
		{
            "_common": 
			{
                "buttonBackToGallery": 
				{
                    "name": "Back To Gallery",
					"method": "backToGallery()",
					"idName": "backToGallery"	
                },
                "buttonStartTutorial": 
				{
                    "name": "Start Tutorial",
					"method": "startTutorialFromDetailsScreen()",
					"idName": "startTutorial"
                },
		        "buttonViewDetails":
                {
                    "name": "View Details",
                    "method": "viewDetails()",
                    "idName": "stepsViewDetails"	
                }
            }
        }
    },
	"tutorial":{
		"_common":{
      		"name":"Integration using TCP/IP sockets",
      		"shortDescription":"Learn how to use TCP/IP nodes for integration with external applications by using TCP/IP sockets.",
	      	"durationText":"This tutorial takes approximately",
	      	"durationTime":"10 minutes",
	      	"_resourceToOpenComment":"The ID of the first resource to open when the user imports the tutorial. Resource IDs are defined in the repo_metadata.json Tutorials listing on ot4i.",
	      	"resourceToOpen":"MainFlow",
	      	"helpLink":{
	       		"text": "IBM Knowledge Center Topic",
	          	"link": "/com.ibm.etools.mft.doc/bz90050_.htm"
	      	}
	    },
	    "pageDetails":{
			"topicsName":"Tutorial Topics",
			"_topicListComment":"A short list of product concepts or tasks demonstrated by this tutorial",
			"topicList":[
	        	{
	          		"title":"Use of the TCPIPClientInput node."
	        	},
	        	{
	          		"title":"Use of the TCPIPServerOutput node."
	        	},
	        	{
	          		"title":"TCP/IP configurable services."
	        	}
	      	],
			"outcomesName":"Learning outcomes",
		    "_outcomesComment":"A description of what the user will have learned or accomplished by running this tutorial.",
	    	"outcomeList":[
	        	{
	          		"title":"Understand how to use the TCPIPClientInput and the TCPIPServerOutput nodes in integration flows."
	        	},
	        	{
	          		"title":"Learn how to configure and manage TCP/IP connections by using configurable services."
	        	}
	      	],
	      	"summary":{
	        	"overviewName":"OVERVIEW",
	        	"_overviewComment":"A short description of what happens in this tutorial, and an optional short explanation of the IIB concepts used in this tutorial if necessary for context. What background knowledge must the user have for this to make sense?",
	        	"sections":[
	          		{
	            		"section":"IBM Integration Bus enables you to integrate with external applications by using TCP/IP sockets. Two sets of TCP/IP message flow nodes exist in IBM Integration Bus: TCPIPServer nodes and TCPIPClient nodes. Both sets have identical function in terms of accessing the data streams; however, one set uses client connections and the other set uses server connections. This tutorial also uses configurable services as a convenient way to manage the TCP/IP connections."
	          		},
	          		{
	            		"section":"This tutorial includes an application called 'TCPIPServer' that simulates a TCP/IP server that is configured to send the data over  TCP/IP sockets. The main message flow in the server application is driven by an XML message arriving on the HTTPInput node. When the message flow with the TCPIPServer node is deployed, the TCP/IP server is started automatically." 
	          		},
	          	{	
	            		"section":"This tutorial also demonstrates how a message flow can be driven by the TCPIPClient node. By default, this node does not open a client connection. The way to configure it properly is to use a TCPClient configurable service to enable at least one client connection to be opened when the flow is deployed. The same configurable service also defines the server host name and port number."
	          		},
	          		{
	            		"section":"An important part of TCP/IP input node configuration is setting up the proper record detection algorithm. This tutorial demonstrates the use  of 'Parsed Record Sequence' record detection in XML messages."
	          		},  
	          		{
	            		"section":"You can also find examples of the use of Trace, FileOutput, Mapping, HTTPInput and HTTPReply nodes."
	          		}
	        	]
	        },
	      	"helpLinks":{
	        	"title":"Find out more",
	          	"details":[
	            	{
	              		"title":"Knowledge Center link to ",
	              		"description":"TCP/IP Data Transfer Overview",
	              		"link":"/com.ibm.etools.mft.doc/bz90050_.htm"
	            	},
	            	{
	              		"title":"Knowledge Center link to ",
	              		"description":"TCP/IP Nodes",
	              		"link":"/com.ibm.etools.mft.doc/ac67370_.htm"
	            	},
	            	{
	              		"title":"Knowledge Center link to ",
	              		"description":"TCP/IP Scenarios in Integration Bus",
	              		"link":"/com.ibm.etools.mft.doc/ac67390_.htm"
	            	}
	          	]
			}
	    },
	    "pageSteps":{
			"create":{
	        	"overview":{
	          		"name":"Create",
	          		"heading":"Import Source Code",
	          		"_createComment":"A description of what will happen when the user clicks Import.",
	          		"sections":[
	            		{
	              			"section":"Click <span class='uicontrol'>Import</span> to load the <span class='application'>TCPIPServer</span> and <span class='application'>TCPIPClient</span> applications, and the <span class='library'>DataLibrary</span> shared library into your workspace. These resources are then listed in the Application Development view"
	            		},
	            		{
	              			"section":"Within the <span class='application'>TCPIPServer</span> application, a message flow titled  <span class='filepath'>TCPIPProvider.msgflow</span>  receives the XML message through an HTTPInput node. The message is parsed and passed to the TCPIPServerOutput node to send the data to the client connected on port 7778. The TCPIPServerOutput node is configured by using the configurable service <span class='filepath'>TCPIPTutorialServerCF</span>. To avoid deployment errors, the configurable service must be created on the target deployment integration node before the application is deployed. Trace nodes are used in this tutorial to trace the data flow into the common file while the data travels through the message flow."
	              		},
	            		{
	              			"section":"The <span class='application'>TCPIPClient</span> application contains a message flow called  <span class='filepath'>TCPIPReceiver.msgflow</span>, which uses the TCPIPClientInput node to receive the data from the server. The TCPIPClientInput node is configured with the configurable service <span class='filepath'>TCPIPTutorialClientCF</span> that specifies the host, the port, and the minimum number of  client connections that are automatically opened. This message flow also contains a Mapping node that uses nested maps to  transform the message data into a different format. Finally, the message is written to a file through the FileOutput node."
	            		},
	            		{
	              			"section":"The shared library <span class='library'>DataLibrary</span> contains a message model for the input and output message formats <span class='filepath'>SaleReport.xsd</span>, <span class='filepath'>SaleMessage.xsd</span>, as well as a test message that will be used to initiate the tutorial flow <span class='filepath'>TestSaleMessage.xml</span>. It also contains a batch file <span class='filepath'>configure_tcpip.bat</span> that contains commands are run in the IBM Integration Console to create the two configurable services for this tutorial."
	            		}
	          		]
				},
	        	"helpLinks":{
	          		"title":"Find out more",
	          		"details":[
	            		{
	              			"title":"Knowledge Center link to ",
	              			"description":"TCP/IP nodes",
	              			"link":"com.ibm.etools.mft.doc/ac67370_.htm"
	            		}
	          		]
	        	},
				"actions":{
	          		"title": "Create Actions",
	          		"details":[
	             		{
	               			"name": "Import",
	               			"method": "importArtifacts()"
	             		}
	           		]
				}
	    	},
			"prepare":{
				"overview":{
	          		"name":"Prepare",
	          		"heading":"Exploring the flows and creating configurable services",
	          		"_prepareComment":"A description of what just happened when the user clicked Import, and what will happen when the user clicks Deploy.",
	          		"sections":[
	            		{
	              			"section":"Open the message flow <span class='msgflow'>TCPIPProvider.msgflow</span> in the application <span class='application'>TCPIPServer</span>. The  annotations attached to the nodes provide details of the node configuration. To view details about each node, click on the <span class='view'>Properties</span> view and then select a node on the editor canvas. The <span class='property'>Connection details</span> property of TCPIPServerOutput node points to a configurable service <span class='resource'>TCPIPTutorialServerCF</span>."
	            		},
	            		{
	              			"section":"If you open the message flow <span class='msgflow'>TCPIPReceiver.msgflow</span> in the application <span class='application'>TCPIPClient</span>, you can also view more information about particular node configuration by viewing the annotations shown on the canvas. The <span class='property'>Connection details'</span> property of the TCPIPClientInput node points to a configurable service <span class='resource'>TCPIPTutorialClientCF</span>. The <span class='property'>Records and Elements</span> tab allows you to configure the record detection."
	            		},
	            		{
	              			"section":"To successfully deploy your application to the integration server, you must create two required configurable services. To create the configurable service on the target integration node TESTNODE_<span class='varname'>user_id</span> used by the Flow Exerciser, run the provided <span class='filepath'>configure_tcpip.bat</span> file in the IBM Integration Console. "
	            		},
	            		{
	              			"section":"<b>Tip 1:</b>You might need to adjust the ports in the configurable services commands for your system if port 7778 cannot be used. You can also change the file paths specified by the Trace and FileOutput nodes."
	            		},
	            		{
	              			"section":"<b>Tip 2:</b>You may need to update the file system paths used by the Trace and FileOutput nodes if your operating system is not Windows. <span class='property'>Directory</span> property of the FileOutput node specifies the directory where the output file is written to. <span class='property'>File path</span> property of the Trace nodes specify the full path to the trace file. By default all the files are written to 'C:\temp'. "
	            		},
	            		{
	              			"section":"Next, you will deploy and run the tutorial to see how the data travels from the <span class='application'>TCPIPServer</span> node to the <span class='application'>TCPIPClient</span> node and then to the file on the file system. Click <span class='uicontrol'>Run</span> to see those steps."
	            		}
					]  
				},
	        	"helpLinks":{
	        		"title":"Find out more",
	          		"details":[
	            		{
	                		"title":"Knowledge Center link to ",
	                		"description":"Creating configurable services",
	                		"link":"com.ibm.etools.mft.doc/an37200_.htm"
	            		},
	            		{
	              			"title":"Knowledge Center link to ",
	              			"description":"TCPIPServerOutput node",
	              			"link":"com.ibm.etools.mft.doc/ac67340_.htm"
	            		},
	            		{
	              			"title":"Knowledge Center link to ",
	              			"description":"TCPIPClientInput node",
	              			"link":"com.ibm.etools.mft.doc/ac67300_.htm"
	            		}
	          		]
				}
			},
	    	"run":{
	    		"overview":{
	        		"name":"Run",
	        		"heading":"Follow these steps to complete the tutorial",
	        		"_runComment":"The full steps for the user to run through the tutorial. Use 'sections' to render paragraphs, 'steps' with a type of 'ordered' or 'unordered' to render HTML lists, and 'substeps' to render nested lists.",
	        		"sections":[
	        			{
	            			"section":"Deploy and run the tutorial message flows:",
	              			"steps":{
	                			"type":"ordered",
	                			"details":[
	                  				{
	                    				"details":"Open the  <span class='msgflow'>TCPIPProvider.msgflow</span> message flow from the application <span class='application'>TCPIPServer</span> by double-clicking on it. Click the <span class='icon'>Flow Exerciser</span> icon <img src='http://ot4i.github.io/iib-tutorials/images/icons/iib/startFlowExerciser.png' alt='' /> to start recording the message path through the flow. "
	                  				},
	                  				{
	                    				"details":"Click the <span class='icon'>Send Message</span> icon <img src='http://ot4i.github.io/iib-tutorials/images/icons/iib/sendMessage.png' alt='' /> to select a message to send to the flow."
	                  				},
	                  				{
	                    				"details":"Add a new input message to the tree on the left and check the <span class='uicontrol'>Import from file</span> option. Then select the file <span class='filepath'>/DataLibrary/TestSaleMessage.xml</span> from the workspace. Click the <span class='uicontrol'>Send</span> button to invoke the flow."
	                  				},
	                  				{
	                    				"details":"After the request message is processed, the message path is automatically highlighted on the message flow."
	                  				}
	                			]
							}
						},  
	            		{
	            			"section":"Verify the flow execution:",
				             "steps":{
				            	"type":"ordered",
				              	"details":[
				       	           	{
				        	           	"details":"Click on any connection to see the data that passed through that connection."
				                  	},
				               	  	{
				                   		"details":"You can also open a trace file <span class='filepath'>C:\\temp\\TCPIP_TRACE.txt</span> specified by the Trace nodes to see how the message travels through the message flows."
				                   	},
				               	  	{
				                   		"details":"The same output directory contains the output file <span class='filepath'>C:\\temp\\TCPClientTutorialOutput.txt</span> created by the file output node. The file contains the transformed message SalesReport."
					               	},
				    	           	{
				        	          	"details":"To stop recording the message path through the flow, click the <span class='icon'>Return flow to edit mode</span> icon <img src='http://ot4i.github.io/iib-tutorials/images/icons/iib/stopFlowExerciser.png' alt='Return flow to edit mode' />."
				                  	},
				               	  	{
				                   		"details":"You can click the <span class='uicontrol'>Clean up</span> action to remove the tutorial source code from the workspace. You need to manually go to the target integration servers and delete the deployed applications by using the <span class='uicontrol'>Delete</span> context menu."
				           	       	}
							  	]               	
				            }
			          	}
	        		]
		        },
	        	"helpLinks":{
	        		"title":"Find out more",
	          		"details":[
	            		{
	                		"title":"Knowledge Center link to ",
	                		"description":"Processing TCP/IP messages",
	                		"link":"/com.ibm.etools.mft.doc/bz90050_.htm"
	             		},
	             		{
		               		"title":"Knowledge Center link to ",
	                		"description":"TCP/IP nodes",
	                		"link":"/com.ibm.etools.mft.doc/ac67370_.htm"
	             		},
	             		{
		                	"title":"Knowledge Center link to ",
	                		"description":"TCP/IP scenarios in IBM Integration Bus",
	                		"link":"/com.ibm.etools.mft.doc/ac67390_.htm"
	             		}
	          		]
	        	},
	        	"exits":{
		 			"title": "Run Exits",
		  			"details":[
		     			{
		     				"name": "Clean Up",
		     				"description": "Clean up and remove any changes in your workspace made by the tutorial.",
		     				"method": "cleanUp()"
		     			}
		   			]
		 		}
			}
		}
	}
}
